12/data/attachments/c4008e914b64db72.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_969af944-d2f4-4ef0-a2bb-438e86edbf98</nif:username>
            <nif:friendToBeAdded>Ryan_part_Friend_38619_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>